[
  {
    "description": "Id of the run that completed the task",
    "mode": "REQUIRED",
    "name": "runId",
    "type": "INTEGER"
  },
  {
    "fields": [
      {
        "description": "Deadline of the task, pending and running runs are resolved as exception if not resolved by other means before the deadline. Note, deadline cannot be more than 5 days into the future",
        "mode": "REQUIRED",
        "name": "deadline",
        "type": "TIMESTAMP"
      },
      {
        "description": "Task expiration, time at which task definition and status is deleted. Notice that all artifacts for the task must have an expiration that is no later than this",
        "mode": "REQUIRED",
        "name": "expires",
        "type": "TIMESTAMP"
      },
      {
        "description": "Unique identifier for a provisioner, that can supply specified workerType",
        "mode": "REQUIRED",
        "name": "provisionerId",
        "type": "STRING"
      },
      {
        "description": "Number of retries left for the task in case of infrastructure issues",
        "mode": "REQUIRED",
        "name": "retriesLeft",
        "type": "INTEGER"
      },
      {
        "fields": [
          {
            "description": "Reason for the creation of this run",
            "mode": "REQUIRED",
            "name": "reasonCreated",
            "type": "STRING"
          },
          {
            "description": "Reason that run was resolved, this is mainly useful for runs resolved as exception",
            "mode": "NULLABLE",
            "name": "reasonResolved",
            "type": "STRING"
          },
          {
            "description": "Date-time at which this run was resolved, ie. when the run changed state from running to either completed, failed or exception",
            "mode": "NULLABLE",
            "name": "resolved",
            "type": "TIMESTAMP"
          },
          {
            "description": "Id of this task run, run-ids always starts from 0",
            "mode": "REQUIRED",
            "name": "runId",
            "type": "INTEGER"
          },
          {
            "description": "Date-time at which this run was scheduled, ie. when the run was created in state pending",
            "mode": "REQUIRED",
            "name": "scheduled",
            "type": "TIMESTAMP"
          },
          {
            "description": "Date-time at which this run was claimed, ie. when the run changed state from pending to running. This property is only present after the run has been claimed",
            "mode": "NULLABLE",
            "name": "started",
            "type": "TIMESTAMP"
          },
          {
            "description": "State of this run",
            "mode": "REQUIRED",
            "name": "state",
            "type": "STRING"
          },
          {
            "description": "Time at which the run expires and is resolved as failed, if the run isn't reclaimed. Note, only present after the run has been claimed",
            "mode": "NULLABLE",
            "name": "takenUntil",
            "type": "TIMESTAMP"
          },
          {
            "description": "Identifier for group that worker who executes this run is a part of, this identifier is mainly used for efficient routing. Note, this property is only present after the run is claimed",
            "mode": "NULLABLE",
            "name": "workerGroup",
            "type": "STRING"
          },
          {
            "description": "Identifier for worker evaluating this run within given workerGroup. Note, this property is only available after the run has been claimed",
            "mode": "NULLABLE",
            "name": "workerId",
            "type": "STRING"
          }
        ],
        "description": "List of runs, ordered so that index i has runId == i",
        "mode": "REPEATED",
        "name": "runs",
        "type": "RECORD"
      },
      {
        "description": "All tasks in a task group must have the same schedulerId. This is used for several purposes: it can represent the entity that created the task; it can limit addition of new tasks to a task group: the caller of createTask must have a scope related to the schedulerId of the task group; it controls who can manipulate tasks, again by requiring schedulerId-related scopes; it appears in the routing key for Pulse messages about the task",
        "mode": "REQUIRED",
        "name": "schedulerId",
        "type": "STRING"
      },
      {
        "description": "State of this task. This is just an auxiliary property derived from state of latests run, or unscheduled if none",
        "mode": "REQUIRED",
        "name": "state",
        "type": "STRING"
      },
      {
        "description": "Identifier for a group of tasks scheduled together with this task. Generally, all tasks related to a single event such as a version-control push or a nightly build have the same taskGroupId. This property defaults to taskId if it isn't specified. Tasks with taskId equal to the taskGroupId are, by convention, decision tasks",
        "mode": "REQUIRED",
        "name": "taskGroupId",
        "type": "STRING"
      },
      {
        "description": "Unique task identifier, this is UUID encoded as URL-safe base64 and stripped of = padding",
        "mode": "REQUIRED",
        "name": "taskId",
        "type": "STRING"
      },
      {
        "description": "Unique identifier for a worker-type within a specific provisioner",
        "mode": "REQUIRED",
        "name": "workerType",
        "type": "STRING"
      }
    ],
    "description": "A representation of task status as known by the queue",
    "mode": "NULLABLE",
    "name": "status",
    "type": "RECORD"
  },
  {
    "description": "Message version",
    "mode": "REQUIRED",
    "name": "version",
    "type": "INTEGER"
  },
  {
    "description": "Identifier for the worker-group within which this run ran",
    "mode": "NULLABLE",
    "name": "workerGroup",
    "type": "STRING"
  },
  {
    "description": "Identifier for the worker-group within which this run ran",
    "mode": "NULLABLE",
    "name": "workerId",
    "type": "STRING"
  }
]
